#Область СобытияФорм

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	Обр = РеквизитФормыВЗначение("Объект");
//	Настройки = Обр.НастройкиСоединения();
	
	
КонецПроцедуры

&НаСервере
Функция ВосстановитьНастройки()
	
	Обр = РеквизитФормыВЗначение("Объект");
	
	Результат = Обр.ВосстановитьНастройки();
	Если Результат Тогда 
		ЗначениеВРеквизитФормы(Обр,"Объект");
	КонецЕсли ;	
	
	Возврат Результат ;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ВосстановитьНастройки() Тогда 
		ПоказатьПредупреждение(,"Настройки соединения не восстановлены");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность Тогда 
		ОповещениеЗакрытия = Новый ОписаниеОповещения("ВопросЗавершение",ЭтотОбъект);
		Отказ = Истина ;	
		ПоказатьВопрос(ОповещениеЗакрытия,"Сохранить настройки ?",РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли ;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСоединения(Команда)
	ТестСоединенияНаСервере();
КонецПроцедуры

#КонецОбласти 

&НаКлиенте 
Процедура ВопросЗавершение(Результат,ЛопПараметры)Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		СохранитьНастройки();
		Модифицированность = Ложь;
		Закрыть() ;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь ;
		Закрыть() ;
	Иначе
		
	КонецЕсли ;	
	
КонецПроцедуры

&НаСервере
Процедура ТестСоединенияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	Обр = РеквизитФормыВЗначение("Объект") ;
	Обр.СохранитьНастройки() ;
КонецПроцедуры 	

&НаКлиенте
Процедура ФормаИзменена(Элемент)
	Модифицированность = Истина ;
КонецПроцедуры
